

aa=[13	25	4	10	15	27	7	3	29	20	6	18	32	30	22	26	11	16	31	2	19	24	8	28	1	14	17	9	12	21	5	23];    %<<<<<<<<<<<隨機位置
II=[1 1 1 1 2 2 2 2 3 3 3 3 4 4 4 4 5 5 5 5 6 6 6 6 7 7 7 7 8 8 8 8];
cc=[2 1 1 ;   %<<<<<<<<<<<第一團必看二間,第一次選看二間,第二次選看一間,
    2 1 1 ; 
    2 1 1 ;
    2 1 1 ;
    2 1 1 ;
    2 1 1 ;
    2 1 1 ;
    2 1 1 ];
d2=[1 6 ;    %<<<<<<<<第一團必看房間號碼 (補999為滿足矩陣相等)
    1 6 ;  
    1 6 ;
    1 3 ;
    1 3 ;
    1 5 ;
    1 5 ;
    1 5];
pp=[2 3 ;   %<<<<<<<第一團第一次選看房間號碼 (補999為滿足矩陣相等)
    2 3 ; 
    2 3 ;
    2 5 ;
    2 5 ;
    2 6 ;
    2 6 ;
    2 6 ];     
gg=[4 5 ;  %<<<<<<<第一團第二次選看房間號碼 (補999為滿足矩陣相等)
    4 5 ;  
    4 5 ;
    4 6 ;
    4 6 ;
    3 4 ;
    3 4 ;
    3 4 ];

bb=zeros(size(aa));
k=0;
[x,y]=size(cc);
x0=0; x00=0; x1=0; x2=0; x3=0; x4=0;

for i=1:x
   
    x0=max(find(d2(i,:)<990));
    pp0=d2(i,:);
    x00=find(pp0>990);
    pp0(x00)=[];
    x00=find(pp0>990);
  
    c1=pp0;
    b1=[aa(k+1:cc(i,1)+k)];
    [u u1]=sort(b1);
    
    for i1=1:max(size(b1))
      y= u1(i1)+k;
      z= u(i1);
      A=mod(aa(y)+z,x0)+1;
    bb(y)=c1(A);
    x0=x0-1;
    c1(A)=[];
    end
    
    x1=max(find(pp(i,:)<990));
    pp1=pp(i,:);
    x2=find(pp1>990);
    pp1(x2)=[];
    x2=find(pp1>990);

    c2=pp1;
    b2=[aa(cc(i,1)+k+1:cc(i,1)+k+cc(i,2))];
    [s s1]=sort(b2);
    
   
        for j=1:max(size(b2))
          p= s1(j)+k+cc(i,1);
          q= s(j);
          B=mod(s1(j)+k+cc(i,1)+s(j),x1)+1;
          bb(s1(j)+k+cc(i,1))=c2(B);
          x1=x1-1;
         
          c2(B)=[];
         
        end
   
    x3=max(find(gg(i,:)<990));
    pp2=gg(i,:);
    x4=find(pp2>990);
    pp2(x4)=[];
    x4=find(pp2>990);
    
    c3=pp2;
    b3=[aa(cc(i,1)+cc(i,2)+k+1:cc(i,1)+k+cc(i,2)+cc(i,3))];
    [v v1]=sort(b3);
    
   
        for j=1:max(size(b3))
          v3= v1(j)+k+cc(i,1)+cc(i,2);
          v4= v(j);
          C=mod(v1(j)+k+cc(i,1)+cc(i,2)+v(j),x3)+1;
          bb(v1(j)+k+cc(i,1)+cc(i,2))=c3(C);
          x3=x3-1;
         
          c3(C)=[];
         
        end
       
     k=k+cc(i,1)+cc(i,2)+cc(i,3);
     
end

bb
      